rottenpotatoes/app/controllers/movies_controller.rb

  def find
    @movie = Movie.find_by(title: params[:title])
    director = @movie.director
    if director.blank? or director.nil?
      redirect_to movies_path, alert: "'#{params[:title]}' has no director info"
    end
    @similar_titles = Movie.where(director: director).pluck(:title)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."title" = ? LIMIT 1  [["title", "Aladdin"]]
SELECT "movies"."title" FROM "movies" WHERE "movies"."director" = ?  [["director", "Joe"]]

  def create
    @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "rating", "director", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Star Wars"], ["rating", "PG"], ["director", "George Lucas"], ["created_at", "2018-03-18 09:38:29.650373"], ["updated_at", "2018-03-18 09:38:29.650373"]]